{
    "basics": {
        "name": "Krishna Prasath, Solaisamy",
        "label": "Full-Stack Software Developer",
        "email": "krishnaprasath9695@gmail.com",
        "url": "krishnaprasath.github.io",
        "location": {
            "city": "Chennai",
            "region": "TN",
            "countryCode": "IN"
        },
        "summary": "I am a software developer skilled in full-stack development, technical writing, and scientific programming. Passionate about helping others through technology, I've built end-to-end testing tools, crafted extensive documentation, and worked directly with developers to identify product improvements. I value communication highly and have great experience presenting technical content, including six years of teaching experience, multiple published research papers, and presentations to technical and non-technical audiences.",
        "profiles": [
            {
                "network": "in/krishna-prasath",
                "url": "https://www.linkedin.com/in/skrishnaprasath/"
            }
        ]
    },
    "work": [
        {
            "name": "Comcast",
            "position": "Development Engineer 3",
            "startDate": "2022",
            "endDate": "Present",
            "highlights": [
                "Designed and developed full-stack application with Flask and Javascript for configuring and testing REST APIs in conjunction with frontend SDKs",
                "Crafted extensive technical documentation and sample code for new product features to accelerate product adoption",
                "Gathered product and documentation feedback by collaborating directly with external developers"
            ]
        },
        {
            "name": "Kycres, remote",
            "position": "Full Stack Engineer",
            "startDate": "2020",
            "endDate": "2022",
            "highlights": [
                "Joined as the first full-time development employee to transform a promising Health Management idea into a fully functional web application, building it from scratch.",
                "Designed and implemented RESTful API calls using React to enhance user interface performance and ensure seamless data integration.",
                "Collaborated across all stages of the systems development lifecycle, from requirement gathering to production releases, ensuring smooth project progression and successful delivery."
            ]
        },
        {
            "name": "GUVI",
            "position": "Full Stack Developer",
            "startDate": "2019",
            "endDate": "2020",
            "highlights": [
                "Contributed as a key member of a small development team responsible for maintaining and testing the web application for GUVI (EduTech), ensuring optimal performance and stability for 15k to 20k daily users."
            ]
        },
        {
            "name": "Amazon Development Center",
            "position": "SDE Intern",
            "startDate": "Jan&nbsp;2019",
            "endDate": "June&nbsp;2019",
            "highlights": [
                "Contributed to the development of the Knowledge Center guided workflow, improving productivity and reducing resolution time for 2000+ Customer Service Associates."
            ]
        },
        {
            "name": "Amazon Development Center",
            "position": "Customer Service Associate",
            "startDate": "2017",
            "endDate": "2019",
            "highlights": [
                "As a Customer Service Associate (CSA), I efficiently handled up to 50 issues per day, which helped me develop strong action-oriented problem-solving skills, self-discipline, and organizational abilities.", 
                "Consistently demonstrated strong interpersonal skills by empathizing with and prioritizing customer needs, effectively engaging with a diverse customer base on a daily basis."
            ]
        }
    ],
    "education": [
        {
            "institution": "Sri Krishna Arts and Science College",
            "area": "Software Systems",
            "studyType": "Master of Science",
            "studyTypeShort": "M.Sc",
            "startDate": "2012",
            "endDate": "2017"
        }
    ]
}